[
	 {
		"name": "Crafting",
		"type": "Thông Tin",
		"text": "Craft item sẽ nhận được các affix cố định cùng với tối đa 4 affix bổ sung.\nCác affix có thể nhận được phụ thuộc vào affix level(alvl), vốn phụ thuộc vào item level(ilvl). ilvl của vật phẩm craft được xác định bằng character level(clvl) và ilvl của phôi.\n- craft ilvl = clvl/2 + ilvl/2 (giá trị được làm tròn xuống)\n\nSố lượng affix bổ sung phụ thuộc vào ilvl:\n- ilvl 1-30 : 4 affix (20%), 3 affix (20%), 2 affix (20%), 1 affix (40%)\n- ilvl 31-50 : 4 affix (20%), 3 affix (20%), 2 affix (60%)\n- ilvl 51-70 : 4 affix (20%), 3 affix (80%)\n- ilvl 71+ : 4 affix (100%)\n+ Lưu ý rằng shop bán magic item(đồ xanh/blue) có ilvl = clvl+5, còn gamble có ilvl trong khoảng clvl-5 -> clvl+4. Ví dụ khi một nhân vật level 86 gamble amulet thì có thể nhận được một cái amulet có ilvl 90 và khi sử dụng amulet này để craft thì có cơ hội nhận được option +2 class skill(đây là một affix bổ sung). ilvl90 là tối tiểu để nhận được option trên.\n\nCấp độ tiền tố (Affix Level - alvl) quyết định những tiền tố (affix) nào có thể xuất hiện trên trang bị. alvl được tính dựa trên 3 yếu tố:\n• Cấp độ vật phẩm (Item Level - ilvl) – Thay đổi tùy nguồn rơi.\n• Cấp độ chất lượng (Quality Level - qlvl) – Cố định theo loại trang bị.\n• Cấp độ ma thuật (Magic Level - maglvl) – Chỉ áp dụng cho một số vật phẩm đặc biệt.\nCông thức tính alvl:\n• 1. Nếu qlvl > ilvl: ilvl = qlvl\n Trang bị không thể rơi với ilvl thấp hơn qlvl của nó, trừ khi bị biến đổi (ví dụ: Imbue hoặc công thức Cube).\n• 2. Vật phẩm có maglvl > 0: alvl = ilvl + maglvl\nÁp dụng cho: Wands, Staves, Orbs: maglvl = 1. Circlet (3), Coronet (8), Tiara (13), Diadem (18).\n Ảnh hưởng: Giảm ilvl tối thiểu để nhận affix cao cấp.\n Ví dụ: Tiara (maglvl=13) có thể nhận +2 class skill ở ilvl 77 (thay vì 90+). Diadem (maglvl=18, qlvl=86): Luôn có alvl = 99 (ilvl không quan trọng).\n• 3. Vật phẩm thông thường (maglvl = 0):\nNếu ilvl < (99 - [qlvl/2]):  alvl = ilvl - [qlvl/2]\n Ngược lại: alvl = 2*ilvl - 99 \nVật phẩm có qlvl thấp (ví dụ: Amulet, Ring, Jewel, Quiver - qlvl=1): alvl = ilvl \n Vật phẩm có qlvl cao (ví dụ: Elite Unique): Cần ilvl cao để đạt alvl tối đa. \n\nGiải thích qua ví dụ:\n Một Amulet (qlvl=1) rơi ở ilvl 90: alvl = 90 (vì qlvl=1) → Có thể nhận mọi affix yêu cầu alvl ≤ 90.\n Một Archon Plate (qlvl=85) rơi ở ilvl 85: 99 - [85/2] = 57 → ilvl (85) > 57 → alvl = 2*85 - 99 = 71 → Đủ điều kiện nhận affix cấp 71+.\n Một Tiara (qlvl=55, maglvl=13) rơi ở ilvl 77: alvl = 77 + 13 = 90 → Nhận được +2 class skill (yêu cầu alvl 90)."
	},
	{
		"name": "AR",
		"type": "Thông Tin",
		"text": "Hầu hết các kỹ năng sử dụng vũ khí đều yêu cầu kiểm tra trúng đích (Hit Check) để xác định xem đòn tấn công có thành công hay không. Chỉ số Tấn công (Attack Rating - AR) đối trọng với Phòng thủ (Defense) của mục tiêu trong công thức tính Tỷ lệ Trúng đích (Chance to Hit).\nCông thức cơ bản tính Chỉ số Tấn công (Base Attack Rating):\n\n• * Base Attack Rating = ((Dexterity - 7) * 5) + Class Constant\n\n• Dexterity: Chỉ số chính ảnh hưởng đến AR.\n• Class Constant: Hằng số riêng của mỗi nhân vật (ảnh hưởng đến AR cơ bản).\n\n Giải thích chi tiết:\n• * Hit Check (Kiểm tra trúng đích):\n• * Khi sử dụng kỹ năng gắn với vũ khí (ví dụ: Zeal, Fury, Strafe), game sẽ tính toán Chance to Hit dựa trên:\n• * AR (Attack Rating) của người tấn công.\n• * Defense của mục tiêu.\n Nếu Hit Check thành công, đòn đánh mới gây sát thương.\n- Mỗi điểm Dexterity cung cấp +5 AR.\n- Ví dụ: Nhân vật có 100 Dexterity sẽ nhận:\n• (100 - 7) * 5 = 465 AR (chưa cộng Class Constant)\n Class Constant (Hằng số nhân vật): Mỗi nhân vật có AR cơ bản khác nhau.\n• Amazon\t\t 5\n• Assassin\t   15\n• Barbarian\t  20\n• Druid\t  \t5\n• Necromancer   -10\n• Paladin\t\t20\n• Sorceress\t -15\n• Công thức hoàn chỉnh tính Tỷ lệ Trúng đích (Chance to Hit):\n• * Chance to Hit (%) = 200% * (AR / (AR + Defense)) * (Attacker Level / (Attacker Level + Defender Level))\n• Nếu kết quả lớn hơn 95%, sẽ bị giới hạn ở 95%.(tỉ lệ đánh trúng tối đa là 95%)\n• Nếu kết quả dưới 5%, sẽ bị giới hạn ở 5%.(vì tỉ lệ đánh trúng tối tiểu là 5%).\n\n Ignore Target Defense(itd): khi hiệu ứng này kích hoạt thì Defense của mục tiêu sẽ bằng 0 -> tỉ lệ đánh trúng của bạn sẽ tăng tối đa (95%). Lưu ý itd chỉ có tác dụng với quái thông thường, không có tác dụng với boss, player, mercenary và tất cả các quái có tên riêng(ví dụ như Bishibosh ở Cold Plain, hay Rakanishu ở Stony Field...)\n\n-Target Defense: Hiệu ứng này giúp giảm phòng thủ của mục tiêu theo % sau khi đã tính toán các hiệu ứng +xx%Defense trên phòng thủ cơ bản của chúng. Ví dụ quái có phòng thủ cơ bản là 1000. và +200% defense -> phòng thủ quái là 3000 -> áp dụng hiệu ứng -target defense lên giá trị cuối là 3000. Lưu ý hiệu ứng này chỉ có tác dụng bằng 1 nửa với các mục tiêu sau: player, mercenary, boss, quái có tên riêng(boss maps,...)"
	},
	{
		"name": "IAS",
		"type": "Thông Tin",
		"text": "Hầu hết các đòn tấn công sử dụng breakpoint tiêu chuẩn, trừ những đòn tấn công đặc biệt như (multi hit, wereform) sử dụng breakpoint khác.\n\n *** Công thức: TAS = Effective Item IAS + Skill IAS - WSM\n\n - WSM: Weapon Speed Modifier là chỉ số tấn công cơ bản của vũ khí(club là -10, mace là 0...)\n - Skill IAS: Tốc độ đánh từ kỹ năng(Burst of Speed, Frenzy, Werewoft, Fânticism), và các hiệu ứng giảm tốc từ quái(Decrepify, Holy Freeze)\n - Effective Item IAS: %IAS từ trang bị\n - TAS: Total Attack Speed: Tổng tốc độ đánh sau cùng\n\n Trường hợp đặc biệt:\n     * Nếu WSM = Skill IAS = 0 thì TAS = Effective Item IAS\n     * Nếu WSM hoặc Skill IAS khác 0 thì Effective Item IAS = TAS - Skill IAS + WSM\n\n\n *** Khi biến hình(Wereform Weapon Threshold - WWT) được tính bằng :\n\n           WWT = WIAS(Weapon IAS) - WSM\n\n Tốc độ đánh của Werewolf/Werebear phụ thuộc mạnh vào IAS trên vũ khí (Weapon IAS) hơn các đòn tấn công thông thường\n Weapon IAS KHÔNG bao gồm IAS từ trang bị khác (như găng tay, áo giáp). Nó là giá trị trên vũ khí, không phải Effective IAS. Do đó, không thể cộng trừ trực tiếp với Total Attack Speed (TAS) trong bảng breakpoint\n WWT càng cao → TAS càng cao (vì Weapon IAS đồng thời tăng cả WWT và TAS). Werewolf cung cấp +20 tốc độ đánh tối thiểu(level của werewolf càng cao cung cấp tốc độ đánh càng nhiều, werewolf level 20 +68% ias), giúp bù đắp WSM chậm (ví dụ: War Pike +20) và ngăn TAS âm.https://imgur.com/aQJJ6qn https://imgur.com/QRfk6SK https://imgur.com/Ze8fbd3"
	},
	{
		"name": "Critical Damage",
		"type": "Thông Tin",
		"text": "Sát thương chí mạng (Critical Damage) đã được cân bằng lại để cải thiện việc lựa chọn trang bị, giúp Deadly Strike(DS) có sức mạnh tương đương với các chỉ số khác. Nhiều nguồn tỷ lệ chí mạng cũng được điều chỉnh tương tự, đồng thời một số kỹ năng được tăng sát thương để bù đắp.\nThay đổi quan trọng:\n     Giới hạn tỷ lệ chí mạng(crit chance):\n          Mỗi nguồn chí mạng (Deadly Strike, Critical Strike, Weapon Mastery) giờ bị giới hạn 75% (thay vì 100%).\n          Sát thương chí mạng chỉ nhân 1.5x (thay vì 2x) sát thương vật lý.\n     Chỉ số mới:\n          '+x% maximum Deadly Strike' xuất hiện trên một số trang bị (ví dụ: Wraithskin, Death Cleaver, Headstriker).\n          Cho phép đạt 100% DS nếu kết hợp đủ các nguồn này.\nCó 3 nguồn tăng crit chance:\n          Deadly Strike (DS): Từ trang bị (Highlord’s Wrath, Gore Rider) hoặc kỹ năng Blessed Aim (Paladin).\n          Critical Strike (CS): Kỹ năng Critical Strike (Amazon), Joust (Paladin).\n          Weapon Mastery (WM): General Mastery, Polearm/Spear Mastery, Throwing Mastery, Claw/Dagger Mastery, Javelin/Spear Mastery.\n\n     Công thức tính tổng tỷ lệ chí mạng:\n          Tổng Crit Chance = 1 - [(1 - DS) × (1 - CS) × (1 - WM)] (Làm tròn xuống đến % gần nhất)\n\n Ví dụ 1: Amazon có: 50% DS (từ trang bị), 50% CS (từ kỹ năng) 0% WM:\n          1 - [(1 - 0.50) × (1 - 0.50)] = 1 - (0.5 × 0.5) = 75%\n Ví dụ 2: Amazon có: 40% DS, 65% CS, 30% WM (từ Javelin Mastery)\n          1 - [(0.6) × (0.35) × (0.7)] = 1 - 0.147 = 85.3% → Làm tròn thành **85%**\nGiới hạn tối đa lý thuyết: 75% DS + 75% CS + 35% WM → ~95% tổng crit chance.\n\nCrushing Blow (cb) giảm một phần máu hiện tại của mục tiêu, do đó hiệu quả hơn với những mục tiêu có nhiều máu, và kém hiệu quả hơn khi mục tiêu yếu máu.\nĐòn tấn công có thể có tối đa 100% cơ hội gây Crushing Blow — mọi phần trăm vượt quá sẽ không có tác dụng thêm.\nCrushing Blow giờ bị giảm hiệu lực mạnh hơn đối với boss (boss act, boss map, Uber boss...). Lượng máu bị giảm bởi đòn cận chiến giờ đã bằng với đòn tấn công tầm xa.\nBảng tỉ lệ giảm máu theo loại mục tiêu:\n     Hầu hết mục tiêu*\t1/8\n     Super Uniques\t    1/8\n     Boss\t             1/80**\n     Players,Mercenary\t1/10\n* 'Hầu hết mục tiêu' bao gồm normal, minion, Champion, and Unique.\n** Hiệu ứng cb giảm dàn hiệu quả (diminishing returns) theo công thức: 80 + (missing hp%)^2.\n\nOpen Wounds gây sát thương vật lý theo thời gian. Lượng sát thương phụ thuộc vào cấp độ của nhân vật gây ra hiệu ứng này\nSát thương giờ đây chịu ảnh hưởng bởi thuộc tính mới: '+X Open Wounds Damage per Second', thường đi kèm với hiệu ứng 'X% Chance of Open Wounds'.\nSát thương OW giờ cũng bị ảnh hưởng bởi by Physical Damage Reduction(giảm sát thương vật lý) ví dụ như các kỹ năng: Battle Cry, Amplify Damage, Defiance, v.v.\nSát thương OW không bị ảnh hưởng bởi các bộ tăng sát thương khác.\nHiệu ứng OW giờ cũng được kích hoạt bởi 'Attacker Takes Damage of X', ngoài các đòn tấn công thông thường.\nThời gian hiệu lực của OW giờ là 5 giây (trước đây là 8 giây) và có thể chồng tối đa 3 lần trên mỗi mục tiêu.\nOW giờ chịu giảm hiệu lực còn 1/4 khi áp dụng lên pets và mercenary.\nOW không còn bị giảm một nửa sát thương khi áp dụng lên các kẻ địch mạnh (champions, uniques, super uniques, bosses, prime evils)."
	},
	{
		"name": "Magic Find",
		"type": "Thông Tin",
		"text": "Magic Find(MF) làm tăng tỷ lệ rơi đồ rare/set/unique\n1. Công thức tính MF hiệu quả: MF có hiệu quả giảm dần đối với đồ rare, set và unique\n     Magic          MF thực tế = MF trên đồ\n     Rare           (600 * MF / (600 + MF))\n     Set            (500 * MF / (500 + MF))\n     Unique         (250 * MF / (250 + MF))\n300 MF sẽ cho:\n     Rare: (600 * 300 / (600 + 300)) = 200 MF hiệu quả\n     Unique: (250 * 300 / (250 + 300)) = 136 MF hiệu quả\n\n2. So sánh MF và tốc độ farm\nA. Nếu bạn có 0 MF và muốn biết MF sẽ giúp tăng bao nhiêu % tỷ lệ rơi đồ unique thì hãy nhìn vào bảng bên dưới:\n     Với 200 MF trên đồ -> 111 MF hiệu quả với đồ unique thì bạn sẽ có 111% drop đồ unique so với 0 MF tương đương với farm nhanh hơn 111%\nB. Nếu bạn đã có MF và muốn biết thêm MF có đáng không?\n     Giả sử bạn có 200 MF(111 MF hiệu quả) và muốn thêm 50 MF thành 250 MF(125 MF hiệu quả): thì sẽ tăng thêm 16% đồ unique -> có lợi nếu tăng thêm MF mà không làm giảm tốc độ farm quá nhiều. Công thức :\n          % tăng = [(MF_mới + 100) / (MF_cũ + 100)] * 100% - 100%\n\n3. Giới hạn của MF\n     MF chỉ ảnh hưởng đến đồ Magic,Rare,Set,Unique\n     MF không tăng tỷ lệ rơi Rune,Gem,Craft Material...\n Nếu 1/3 giá trị farm được đến từ Rune/Gem.. thì lợi ích của MF giảm 1/3\n       • 111 MF unique -> 74 MF do phải tính cả Rune/Gem\n\n4. Tối ưu MF\n     Cân bằng giữa MF và tốc độ clear. Nếu farm Andariel/Mephitos/Duriel thì nên tập trung cho MF cao.\n     MF không ảnh hưởng đến chất lượng Affix trên đồ, tỷ lệ rơi phôi\n\n5. Tổng kết:\n     MF càng cao -> đồ unique, rare càng nhiều nhưng hiệu quả giảm dần.\n     Nên kết hợp giữa tốc độ farm để tối ưu nhất.\n     Nếu chỉ farm Rune/Craft Material thì MF ít quan trọng hơn\n Lưu ý MF chỉ nhân lên tỷ lệ rơi đồ gốc: nếu tỷ lệ rơi Unique gốc là 0.1% thì với 50 MF (42 MF hiệu quả) -> tỷ lệ mới là 0,142%https://imgur.com/SjnQu7p.png"
	},
	{
		"name": "Corruptions",
		"type": "Thông Tin",
		"text": "1. Worldstone Shard (wss) là một vật phẩm mới có thể rơi ở bất kỳ đâu trong game. Wss dùng để làm biến đổi (Corrupted) trang bị:\n   • Thêm socket (nếu trang bị có thể có socket)\n   • Nhận mod đặc biệt (tăng thêm chỉ số ngẫu nhiên)\n   • Brick (trang bị có thể biến thành đồ rare ngẫu nhiên\n\n2. Corrupt trang bị (hay còn gọi là slam)\nA. Normal Item (không phải unique,set,runeword,magic,rare) không có socket :\n   • 50% thêm socket (số socket từ 1 đến tối đa theo từng loại trang bị)\n   • 50% biến thành đồ rare(brick)\nB Unique,Set,Rare,Magic Item:\n Nếu trang bị có thể thêm socket:\n   • 25% thêm socket (số lượng socket ngẫu nhiên, có thể 1 hoặc tối đa theo từng loại trang bị)\n   • 50% nhận thêm thuộc tính đặc biệt(có 3 loại thuộc tính là thấp, trung, cao)\n   • 25% biến thành đồ rare(brick)\n Nếu không thể thêm socket (vd: ring,amulet,gloves,belt,boots,throw,javelin...):\n   • 75% nhận option\n   • 25% thành rare\n\n3. Tỷ lệ số Socket khi slam thành công - tỷ lệ%(socket):\n   • Armor(Helm/Armor/Shield): 48%(1), 28%(2), 24%(3)\n   • Vũ khí 1 tay: 48%(2), 28%(3), 24%(4)\n   • Vũ khí 2 tay: 30%(3), 28%(4), 24%(5), 18%(6).\n2. Nếu một vật phẩm có thể nhận lỗ nhưng không nhận được qua corrupt, nó vẫn có thể nhận lỗ bằng các cách khác. Larzuk's Puzzlebox khá hiếm có thể được dùng để thêm 2-6 lỗ cho vũ khí hai tay hoặc 1-2 lỗ cho các vật phẩm khác. Larzuk's Puzzlepiece hoạt động tương tự và phổ biến hơn, nhưng không thể dùng cho các vật phẩm unique/set. Trong điều kiện lý tưởng, người chơi có thể nhắm đến các vật phẩm corrupt với số lỗ tối đa hoặc thuộc tính corrupt độ hiếm cao với lỗ được thêm bởi puzzlebox. Thuộc tính corrupt độ hiếm cao thường mạnh hơn một chút so với 2 lỗ trên vũ khí hoặc 1 lỗ trên giáp, vì vậy là lựa chọn tốt nhất trong hầu hết trường hợp, tuy nhiên nhiều lỗ hơn cho phép tùy chỉnh nhiều hơn. Do giá trị của puzzlebox khác so với worldstone shard, thường tốt hơn khi corrupt vật phẩm trước khi dùng puzzlebox. Sử dụng puzzlebox trước sẽ tăng cơ hội nhận thuộc tính corrupt (75% thay vì 50%), nhưng cơ hội làm hỏng vật phẩm vẫn giữ nguyên (25%), nên puzzlebox có thể bị lãng phí."  
	},
	{
		"name": "Resistance",
		"type": "Thông Tin",
		"text": "Resistance (kháng) là chỉ số thể hiện khả năng giảm sát thương nhận vào từ một loại nguyên tố (Fire, Cold, Lightning, Poison) hoặc sát thương đặc biệt khác (Phyiscal, Magic). Kháng tối đa cơ bản là 75%, nhưng có thể nâng lên 90% bằng item hoặc kỹ năng (95% bản LoD), mỗi nhân vật đều bắt đầu với 0% res cơ bản, và bị giảm dần theo từng độ khó(nightmare -40%, hell -100%)\n1. Giảm kháng vs Xuyên kháng \n    Giảm kháng: Áp dụng trước khi tính sát thương, có thể phá immune như Lower Resist, Conviction.\n    Xuyên kháng: Áp dụng sau khi tính sát thương, không phá kháng nhưng hiệu quả 100% nếu mục tiêu đã hết immune. Cold Mastery (Sorceress), Rainbow Facet (-% Enemy Resistance).\n\n2 Khi tấn công quái kháng 100%+(quái immune), các hiệu ứng giảm kháng được áp dụng đồng thời và giảm 1/2 hiệu lực với bản pd2 (bản Lod giảm 1/5 hiệu lực).\nVí dụ: Quái kháng Fire 110%\n    Lower Resist (-30%) → -30 / 2 = -15%\n    Conviction (-30%) → -30 / 2 = -15%\n    Tổng giảm: 110 - 15 - 15 = 80% (kháng còn 80% → đã phá kháng).\n→ Sau khi phá kháng, xuyên kháng (Cold Mastery, Facet) sẽ hoạt động 100% hiệu lực.\n\n3. Nếu kháng của mục tiêu xuống dưới 0%, thì mỗi 1% -res bạn sẽ tăng được 1% damage, phần âm sẽ bị giảm 1/2 hiệu lực. Ví dụ quái có cold resist 30%, áp dụng conviction -34 và lower resist -30 thì quái còn: 30 - 34 -30 = -34 res, do quái âm res bị giảm 1/2 tác dụng nên -34 còn -17% (quái âm res bị giảm 1/2 hiệu lực từ convic,lower resist và pierce enemy resistance chỉ có ở mod PD2, tác dụng 100% với bản LoD)\n\n4. Kháng tối thiểu: -100% (quái nhận 2x sát thương). Không thể giảm xuống dưới -100%.\nĐặc biệt Cold Resistance còn giảm thời gian bị đóng băng hoặc làm chậm. Amplify Damage và Decrepify áp dụng 100% hiệu lực với quái Immune physic, khác hoàn toàn với Conviction , Lower Resist.\n\nAbsorb (Hấp thụ) là cơ chế giúp nhân vật giảm sát thương nhận vào đồng thời hồi lại máu bằng chính lượng sát thương đã giảm. Có 2 loại Absorb:\n  % Absorb: Giảm % sát thương và hồi máu tương ứng, giới hạn tối đa là 40%.\n  +x Absorb: Giảm một lượng sát thương cụ thể (x) và hồi máu bằng đúng số đó (x). +x Absorb không có giới hạn, có thể chồng nhiều nguồn +x Absorb\nAbsorb được tính sau khi áp dụng kháng, không có Absorb cho sát thương vật lý (Physical), Magic Damage chỉ có +x Absorb (không có % Absorb), máu hồi từ Absorb được tính trước khi nhận sát thương - nếu đầy máu phần hồi thừa sẽ mất\n\nPhysic Damage Reduced By % (PDR) là cơ chế giúp nhân vật giảm sát thương vật lý nhận vào theo tỷ lệ %. Giới hạn tối đa là 50%, có thể bị giảm xuống âm (tối thiểu -100%) bởi Amp hoặc Decrepify. PDR mặc định là 0% và không bị ảnh hưởng bởi độ khó (normal, nightmare, hell).\nPhysical Damage Reduced By (DR) giúp nhân vật giảm lượng sát thương cố định (x) nhận vào trước khi tính PDR. DR không áp dụng cho đòn đánh Crushing Blow hoặc Sacrifice. Nếu DR dư, phần dư sẽ giảm sát thương phép sau khi tính kháng (Fire, Cold, Light, Poison, Magic). DR ít hiệu quả hơn với các kỹ năng gây sát thương theo thời gian.\n\nMagic Resistance (MR) giống các loại kháng khác nhưng MR tối thiểu luôn ở 0%, không bị ảnh hưởng bởi độ khó.\n Magic Damage Reduced giúp giảm sát thương từ Magic, Fire, Cold, Lightning trước khi tính kháng. Nếu MDR dư, phần dư sẽ giảm sát thương khác (physic, fire, cold, light) sau khi tính kháng vật lý." 
	},
	{
		"name": "Poison Damage",
		"type": "Thông Tin",
		"text": "Để hiểu Poison Damage (sát thương độc) và cách game tính toán nó, trước tiên cần hiểu khái niệm Bit, Frame, và Bit Rate (tốc độ gây độc)\n - Bit: Game chuyển đổi Poison Damage thành đơn vị gọi là Bit, Bit là một đơn vị tính sát thương độc theo thời gian (Damage Over Time - DoT). Mỗi điểm sát thương được chuyển thành 256 Bit.\n     Bit là đơn vị nhỏ nhất để do sát thương\n     Game không làm tròn chính xác khi chuyển Bit trở lại thành điểm sát thương. Bất kỳ phép tính nào chuyển từ Bit sang điểm sát thương theo giây đều không chính xác tuyệt đối do các lỗi làm tròn.\n     Bit được sử dụng để xác dịnh tốc độ gây độc (Bit Rate) của một nguồn sát thương độc, và điều này phụ thuộc vào số lượng frame mà hiệu ứng kéo dài.\n\n - Frame là đơn vị đo thời gian nhỏ nhất trong game. 1 Frame = 1/25 giây\n\n - Bit Rate là lượng sát thương độc tính bằng Bit, chia cho số frame mà hiệu ứng độc tồn tại. Để tính Bit Rate cho 1 nguồn sát thương độc hãy sử dụng lệnh !wiki poison."
	},
	{
		"name": "Poison Damage",
		"type": "Thông Tin",
		"text":"1. Poison Damage gây sát thương theo thời gian (DoT) dựa trên 2 yếu tố:\n     Bit Rate: lượng damage gây ra mỗi frame\n     Poison Length: tổng thời gian poison duy trì (tính bằng frame).\nPoison Damage ngăn quái hồi máu trong suốt thời gian hiệu lực, Poison damage chỉ áp dụng trong 1 frame nếu không có sát thương khác. Nếu trong frame đó có sát thương vật lý/phép thì sát thương độc không được tính. Nếu mục tiêu dính hiệu ứng OW thì sát thương độc vẫn được áp dụng cùng lúc.\n2. Công thức:\n   • Bit Rate = (Poison damage * 256) / (Tổng frame),vd: 100 poison damage over 5 seconds -> (100 * 256) / (5 * 25) = 205 Bit/frame -> Mỗi frame gây 205 bit (~0,8 damage/giây)\n   • Poison Length = (Tổng frame) / 25\n3. Khi nhiều nguồn Poison cùng áp dụng thì:\n     Tổng Bit Rate: cộng dồn tất cả\n     Tổng poison length: trung bình cộng\n          ví dụ: small charm (205bit/frame, 125 frame) + Perfect Emerald (146bit/frame, 175 frame) -> tổng bit 351 bit/frame, length (125 +175)/2 = 150 frame -> 205 poison damage/6 giây\n4. Khi một kỹ năng (như Multiple Shot, Strafe, Blade Fury, Blade Sentinel) chỉ áp dụng một phần sát thương của vũ khí (ví dụ: 3/4 hoặc 1/2), Poison Length sẽ được tính khác so với bình thường.\n Công thức:\n     Kỹ Năng          % Sát thương cơ bản         Poison Length\n     Multishot              75% (3/4)          Tổng frame/(số nguồn damage -1)\n     Strafe                 75% (3/4)          Tổng frame/(số nguồn damage -1)\n     Blade Fury             50% (1/2)          Tổng frame/(số nguồn damage -1)\n     Blade Sentinel         75% (3/4)          Tổng frame\n(Blade Sentinel là trường hợp đặc biệt: Poison Length = Tổng Frames của tất cả nguồn, không chia).\n Khi sử dụng Whirlwind + 2 vũ khí độc thì trong frame đầu tiên cả 2 vũ khí đều gây sát thương độc, các frame sau chỉ có vũ khí có bit rate cao hơn được tính."
	},
	
	{
		"name": "Attack Modifiers",
		"type": "Thông Tin",
		"text": "Base Weapon Damage là sát thương cơ bản của vũ khí, mỗi loại vũ khí đều có phạm vi sát thương cố định.\n\n- +% Enhanced Damage(On Weapon) chỉ ảnh hưởng đến base damage của chính vũ khí đó, %ED được áp dụng sau Ethereal (nếu có). Boots và Shield (Kick và Smite) không có %ED on-Weapon, %ED đó được tính như Off-Weapon.\n\n- Enhanced Maximum Damage (EMD) tăng chỉ số max damage (sau khi tính Ethereal và %ED).\n\n- +X Minimum/Maximum Damage nếu thuộc tính này trên vũ khí nó sẽ tăng trực tiếp chỉ số min/max lên vũ khí sau khi đã được tính %ED, nếu là off-weapon thì sẽ không thay đổi chỉ số damage mà vũ khí hiển thị nhưng vẫn được tính vào sát thương thực tế, character screen không hiển thị chính xác do phải tính toán nhiều nguồn sát thương khác.\n\n- Damage +xx là chỉ số được cộng vào cả min/max của vũ khí TRƯỚC khi tính các nguồn sát thương khác, thuộc tính này rất mạnh vì nó được cộng trước khi tính %ED off-weapon, tăng min/max của shield cho Smite, không áp dụng sát tương cho Kick, Blade Sentinel và Blade Fury.\n\n- % Damage off-weapon (%ED off-weapon) là tổng tất các nguồn sát thương khác không phải vũ khí, thuộc tính này được áp dụng sau khi tính Base Weapon Damage, %ED trên vũ khí và các nguồn min/max khác.\n\n- Damage to Demon/Undead được tính như một nguồn damage + xx% Damage Off-Weapon, được cộng dồn với các buff khác như Might, Fanaticism, %ED từ trang bị. Chỉ có tác dụng khi mục tiêu là Demon hoặc Undead. Mặc dù stat này xuất hiện trên vũ khí (vd: +50% Damage to Undead trên Club) thì nó vẫn được tính là Off-Weapon. Đặc biệt không áp dụng cho skill Kick (Assasin) và Smite (Paladin).\n\n- Ví dụ vũ khí Natalya ETH (200%ED, 200% to Demon/Undead):\n     Base 55-70 -> ETH = 68-87\n     200%ED = 204-261\n - War Traverler Adds 15-25 Damage, cần 108 str/dex bonus 75% : 108 * 75% + 108 * 75% = 162% ED, Claw Mastery lv35 + 550% ED. Sử dụng lvl 39 Blade Sentinel(3/4 Wapon Damage) adds 997-1009 Damage thì: \n     Base Damage = (204-261) + (15-25) x 3/4 = 164-214.\n     Tổng ED Off-Weapon: 162% + 550% = 712%\n Vì Adds Damage từ skill là nguồn độc lập nên không bị ảnh hưởng bởi 3/4 Weapon Damage từ Blade Sentinel nên base damage là:\n     (164-214) + (997-1009) = (1161-1223)\n     Tổng Damage: (1161-1223) x (1 + 712%) = 9427-9798\n     Damage quái Demon/Undead: (1161-1223) x (1 + 200%) + (9427-9798) = (3483-3669) + (9427-9798) = (12910-13467)"
	},
	{
		"name": "Uber",
		"type": "Thông Tin",
		"text": "Sự kiện Pandemonium còn được gọi là Uber hay Uber Tristram là thử thách tiếp theo sau khi hoàn thành Hell Baal quest. Đánh bại chúng sẽ rơi Hellfire Torch vật phẩm bắt buộc phải có cho mọi nhân vật. Tất cả Uber đều hồi máu giống như các quái khác, nhưng do lượng máu lớn của chúng khiến tốc độ hồi máu mỗi giây cao hơn đáng kể. Tuy nhiên, quái sẽ không thể hồi máu khi đang bị gây sát thương, do dố các hiệu ứng gây sát thương liên tục như poison hoặc open wounds sẽ ngăn hoàn toàn quá trình hồi máu của chúng. Các thay đổi chỉnh trong PD2:\n• Khi Uber cuối cùng bị đánh bại, chúng sẽ rơi ra Hellfire Torch\n• Uber Tristram (UT) giờ được mở bằng Pandemonium Talisman (ghép lại từ 3 mảnh mini-uber và key)\n• Tất cả hiệu ứng hỗ trợ (buff) sẽ mất khi bước vào UT\n• Người chơi không thể tự do quay lại UT khi còn Uber ở trong. Khi sử dụng Pandemonium Talisman để vào UT thì sẽ tạo ra 3 cổng bạc, chỉ có thể vào lại UT thông qua 3 cổng này (mỗi lượt mở UT đều có 1 lần vào ban đầu và 3 cổng bạc)\n• Uber Mephisto sử dụng Conviction cấp 20 giảm 50% kháng\n• Uber Baal tự động thi triển Lower Resist giảm 75% kháng, kéo dài 25 giây\n• UT được tăng thêm 10% máu và 25% phòng thủ\n• UT không còn rơi Standard of Heroes mà rơi Black Soulstone\n\n Uber Ancient là một phiên bản khác của Madawc, Talic và Korlic, được mở bằng Relic of the Ancients (có được khi ghép 3 mảnh sigil của chúng, rơi khi đánh quái bất kì ở map t1, t2 và t3). Người chơi có thể chọn chiến đấu với 1, 2 hoặc cả 3 Ancients bằng cách click vào các bức tượng của 3 thằng đần. Khi hái đầu 3 thằng đần sẽ rơi ra Standard of Heroes và các vật phẩm khác"
	},
	{
		"name": "Uber",
		"type": "Thông Tin",
		"text": "Diablo Clone(DC hay Dclone) được làm lại trong mod PD2. DClone được mở bằng Vision of Terror (VoT). Khi bị đánh bại. DCclone sẽ rơi ra Annihilus. Nếu VoT được nâng cấp lên độ khó 1 hoặc 2 thì khi đánh bại DClone sẽ có tỷ lệ (1/220 độ khó 1, 1/100 độ khó 2) rơi ra các vật phẩm đặc biệt: Overlord's Helm, Dark Abyss, Itherael's Path, Hadriel's Hand, Aidan's Scar\nDclone hiện đã mạnh hơn rất nhiều so với LoD:\n• Tất cả hiệu ứng hỗ trợ sẽ mất khi vào DClone\n• Người chơi không thể tự do ra/vào khi DClone còn sống\n• Dclone sẽ miễn nhiễm với mọi loại sát thương nếu người chơi cách xa nó khoảng 10 yard\n• Meteor sẽ rơi ngẫu nhiên trong suốt trận đấu\n• Bone Spirit xuất hiện từ Trapped Souls, khi va chạm sẽ gây ra hiệu ứng đốt cháy\n• Dclone được chia thành 4 giai đoạn\n• Giữa mỗi giai đoạn, Dclone sẽ miễn nhiễm sát thương và phóng ra 6 lượt Fire Nova\n• Dclone sẽ triệu hồi 1 bầy xương (Bone Wariror, Skeleton Archer, Horror Mage). Chúng có 60% kháng độc, không bị dính curse, 75% poison length\n• Ở những giai đoạn sau, số lượng meteor và bone spirit xuất hiện nhiều hơn\n• Dclone không thể bị làm chậm\n• Dclone không còn chịu sát thương từ Static Field\n• Dclone có nhiều máu (10 530 hp) hơn so với bản Lod (6427 hp) và có kháng tất cả 30% ở độ khó Tier 0\n• Dclone có tỷ lệ chắn đòn(block chance) là 15%\n• Dclone có 75% poison length và 95% curse length reduction\n\n Vision of Terror được ghép bởi:\n• Black Soulstone: drop ở UT\n• Prime Evil Soul: drop ở Mephisto, Diablo (1/21), Baal Hell (1/13)\n• Pure Demonic Essence: drop ở boss maps"
	},
	{
		"name": "Uber",
		"type": "Thông Tin",
		"text": "Rathma và Mendeln là 2 boss mới, mở bằng Voidstone. Khi bị đánh bại sẽ rơi Tainted Worldstone Shard dùng để slam Anni. Nếu Voidstone được tăng độ khó 1, 2 có tỷ lệ rơi đồ: The Third Eye, Band of Skulls, Cage of the Unsullied (1/220  t1, 1/100 t2) và có tỷ lệ 1/50, 1/48, 1/46 rơi Horadric Navigator, Horadric Almanac, Skeleton Key.\n Lower Resist của Mendeln giảm kháng theo độ khó: 25% t1, 29% t2, 33% t3\n Rathma được chia làm 3 phase và 3 pre-phase. 3 pre-phase đều trước 3 phase chính:\n     Gồm nhiều loại quái chủ yếu là undead, rơi mana, rejuv, anti, trang-oul's jawbone từ undead.\n\n Kỹ năng: Rathma gây damage magic\n• Bone Spear: 1 giáo xương để lại vết lửa đốt theo %hp, không thể block hay né từ Weapon Block, Holy Sword, Evade và Dodge\n• Teeth: Tương tự Teeth\n• Bone Nova: Tạo 1 vòng tròn lửa màu xanh\n• Bone Spear + Teleport: Rathma dịch chuyển đến vị trí của người chơi và liên tiếp bắn 3 Bone Spear, trong thời gian đó hắn không thể sử dụng kỹ năng khác.\n• Summon Conjured Soul: Triệu hồi một Skeleton Mage sử dụng kỹ năng Fissure gây sát thương lửa.\n Mendeln chủ yếu sử dụng poison và 1 skill cold:\n• Poison ball: cầu độc tạo mini poison nova\n• Lower Resist\nSludge Nova: Nhìn như Poison Nova nhưng gây sát thương độc ngay lập tức\n Cold Wave: tương tự baal Cold Wave\n\nCả 2 đều có kỹ năng gây sát thương theo % máu. Rathma triệu hồi Void Knight khi mất máu: 70%hp (1 cold, 2 fire, 1 poison), 50% hp (1 cold, 1 fire, 2 poison, 1 physic), 30%hp (2 cold, 2 fire, 1 poison, 1 physic).\n Mendeln khi mất lượng máu như trên (70,50,30) sẽ teleport ra giữa, triêu hồi 4 Blood Golem(nếu golem di chuyển đến vị trí Mendeln, thì chúng sẽ hồi máu cho Mendeln) và triệu hồi các Poison Vine tạo ra một vòng khí poison bao quanh, sau cùng sẽ là Poison Nova độc cực mạnh và kéo dài.\n Khi triệu hồi cả Mendeln và Rathma đều miễn nhiễm sát thương tới khi người chơi gặt đầu hết quái triệu hồi"
	},
	{
		"name": "Uber",
		"type": "Thông Tin",
		"text": " Lucion là boss mới được thêm ở season 10, mở bằng Shadow of Hatred được ghép bởi:\n• Demonic Insignia: Rơi từ bất kỳ kẻ địch nào trong các cổng đỏ Act 5 (Abaddon / Pit of Acheron / Infernal Pit)\n• Talisman of Transgression: Rơi từ bất kỳ kẻ địch nào trong corrupted zones\n• Flesh of Malic: Rơi từ bất kỳ quái là Demon\n\n Có 2 cấp độ khó, dùng cube để set độ khó. khi vào trận sẽ mất tất cả buff.\n Đánh bại Lucion sẽ mở khoá Temple of the Triune. Tại đây có thể Desecrate(slam) amulet tại Sacrifial Altar. Các option có thể nhận:\n• +1 to All Skills\n• +10% Faster Cast Rate \n• +10% Faster Run/Walk \n• +10% Curse Resistance \n• +[30-40]% Enhanced Damage \n• Cannot Be Frozen \n• +2% to ALL Maximum Resistances \n• All Resistances +[7-10].\n\n Trong Season 11, khi đánh bại Lucion còn có tỷ lệ drop Demonic Cube(dùng để reroll option của đồ unique hoặc set) 1/75 ở Tier 1 và 1/50 ở Tier 2.\n**Level của Lucion và các minions được triệu hồi qua cổng đen là 110. Lucion không thể bị làm chậm hoặc đóng băng. Lucion có 15% Chance to Block. Lucion có 30% kháng tất cả (ele, magic, physic, poison) và 24 000 HP ở độ khó Tier 0**"
	},
	{
		"name": "NHD - Last Collidle",
		"type": "Thông Tin",
		"text": "Next Hit Delay (NHD) và Last Collide (LC) là hai cơ chế nhằm ngăn chặn việc một mục tiêu bị gây sát thương quá mức. Trong khi NHD ảnh hưởng đến một tập hợp kỹ năng cụ thể, thì LC lại ảnh hưởng đến mọi kỹ năng hoặc đòn đánh có khả năng trúng mục tiêu hai lần khi bay xuyên qua chúng.\n\nNext Hit Delay, là một cơ chế chỉ áp dụng cho một số kỹ năng nhất định. Khi mục tiêu bị trúng đòn từ một trong những kỹ năng này, một bộ đếm thời gian nội bộ sẽ bắt đầu. Trong thời gian bộ đếm này đang hoạt động, mục tiêu sẽ không thể bị ảnh hưởng hoặc nhận sát thương từ cùng loại đạn (missle) đó một lần nữa. Tuy nhiên, các kỹ năng khác – dù đến từ cùng người chơi hoặc người chơi khác – vẫn có thể gây sát thương hoặc hiệu ứng như bình thường.Bộ đếm thời gian bắt đầu ngay khi đạn trúng mục tiêu. Thời gian NHD có thể dao động từ 4 Frame (0.16 giây) đến 25 Frame (1 giây).\n\n4-Frames NHD (0,16 giây)\n   • Multishot, Strafe, Lightning Strike, Chain Lightning, Nova, Frost Nova, Poison Nova, Shock Wave, Wake of Fire, Claws of Thunder, Phoenix Strike, Teeth, Battle Cry, Battle Command, Battle Orders.\nMỗi lần kích hoạt kỹ năng tích tụ (Charge) của Martial Arts được tính là một lần thi triển riêng biệt đối với cơ chế NHD. Điều này có nghĩa là mỗi kỹ năng có thể đánh trúng mục tiêu thành công, bất kể tốc độ đá (Kick speed) hoặc số lượng hiệu ứng NHD đang hoạt động của Assassin.\n5-Frames NHD (0.2 giây)\n   • Fissure, Volcano (Fireball)\n6-Frames NHD (0,24 giây)\n   • War Cry\n10-Frames NHD (0,4 giây)\n   • Volcano\n25-Frames NHD (1 giây)\n   • Shock Web, Blade Sentinel, Twister, Tornado."
	},
	{
		"name": "NHD - Last Collidle",
		"type": "Thông Tin",
		"text": "Last Collide là một thuộc tính của đạn (Missile) nhằm ngăn chặn việc mục tiêu bị trúng nhiều lần bởi cùng một loại đạn. Khi đạn di chuyển và va chạm với mục tiêu tiếp theo, nó sẽ kiểm tra xem mục tiêu nào vừa bị trúng gần nhất. Như Lightning, có khả năng xuyên qua (piercing) và tiếp tục di chuyển để trúng các mục tiêu khác. Lightning không bị ảnh hưởng bởi NHD. Trong điều kiện bình thường, Lightning chỉ trúng mỗi mục tiêu một lần, vì kiểm tra của LC sẽ ngăn nó trúng lại mục tiêu vừa bị đánh.Tuy nhiên, nếu có hai mục tiêu đứng thẳng hàng trên đường đi của Lightning, kiểm tra LC sẽ luân phiên giữa hai mục tiêu đó. Do đó, nếu cả hai mục tiêu vẫn đứng trong đường bay của Lightning, chúng có thể bị đánh trúng nhiều lần, nhờ vào sự luân phiên này.Không giống như NHD, LC chỉ áp dụng với từng loại đạn riêng lẻ, và không ảnh hưởng đến khả năng trúng và gây sát thương của các đạn khác."
	},
	{
		"name": "Chance to Cast",
		"type": "Thông Tin",
		"text": "Chance to Cast (CtC) là một thuộc tính đặc biệt trên trang bị, cho phép nhân vật có tỷ lệ % kích hoạt một kỹ năng nhất định khi thực hiện hành động (tấn công, bị tấn công, chặn, giết mục tiêu,...), hành động này phải trúng mục tiêu (không cần gây sát thương).\n\nSynergy vẫn có hiệu lực với kỹ năng được kích hoạt bởi CtC\nKhông bị ảnh hưởng bởi NHD mếu kỹ năng được kích hoạt không nằm trong danh sách NHD."
	},
	{
		"name": "Poison Length Reduced",
		"type": "Thông Tin",
		"text": "Poison Length Reduced (PLR) áp dụng cho character, mercenary (và các units có trang bị plr) giúp giảm thời gian hiệu lực của hiệu ứng Độc. PLR có giá trị tối thiểu là -100% và không giới hạn tối đa. PLR > 99% khiến chỉ frame đầu tiên của tốc độ gây Độc (Poison Bit Rate) được áp dụng, nhưng không tính thời gian độc (Poison Length), điều này nghĩa là bạn sẽ nhận toàn bộ sát thương của đòn đánh độc đó trong 1 frame duy nhất, các frame sau không còn nhận hiệu ứng và sát thương độc. PLR -100% làm tăng gấp đôi Poison Length được áp dụng, đồng nghĩa với việc nhân đôi tổng sát thương nếu hiệu ứng chạy đủ thời gian.\nCharacter và Mercenaries bị giới hạn tối đa 75% PLR. Phạt độ khó đối với PLR: giảm 40% ở Nightmare, giảm 100% ở Hell.\nPLR được kiểm tra khi áp dụng Poison Length và không bị ảnh hưởng bởi việc thay đổi giá trị trong quá trình hiệu lực.\nPLR bị giảm bởi -xx% Enemy Poison Resist. Ví dụ: Một đơn vị có 75% PLR bị tấn công bởi nguồn có -50% Poison Resist, thì PLR hiệu dụng sẽ là 25%.\nCleansing Aura có cơ chế PLR đặc biệt: Nó áp dụng giá trị PLR mỗi 2 giây, không chịu phạt độ khó hoặc giới hạn. Level 17 (từ Runeword Plague): 57% PLR\nVí dụ: Nếu Poison Length ban đầu là 50 giây (sau khi tính PLR từ trang bị), và Cleansing Aura bắt đầu giảm từ giây thứ 2, quá trình giảm sẽ như sau:\n     Tính toán từng bước:\n - Giây 0 → 2: Thời gian độc ban đầu: 50 giây, 2 giây đầu trôi qua (chưa giảm) → còn 48 giây.\n - Giây 2 → 4: Áp dụng 57% PLR lên 48 giây còn lại: 48 x (1 - 0.57)= 48 x 0. = 20.64, Thời gian thực tế trôi qua: 2 giây → còn 18.64 giây.\n - Giây 4 → 6: Áp dụng 57% PLR lên 18.64 giây: 18.64 x 0.43 = 8.015 giây, Thực tế trôi qua: 2 giây → còn 6.015 giây.\n - Giây 6 → 8: Áp dụng 57% PLR lên 6.015 giây: 6.015 x 0.43 = 2.586 giây, Thực tế trôi qua: 2 giây → còn 0.586 giây.\n - Giây 8 → 10: Áp dụng 57% PLR lên 0.586 giây: 0.586 x 0.43 = 0.252 giây.\nThời gian trôi qua: 0.252 giây → hiệu ứng kết thúc. Tổng thời gian độc: 2 giây (chưa giảm), 2 giây (giảm còn 20.64) → 4 giây, 2 giây (giảm còn 8.015) → 6 giây, 2 giây (giảm còn 2.586) → 8 giây, 0.252 giây (kết thúc) → ~8.252 giây.\nNhư vậy, Thời Gian Độc 50 giây chỉ còn hiệu lực 8.252 giây khi Cleansing Aura level 17 được kích hoạt."	
	},
	{
		"name": "Chance to Block",
		"type": "Thông Tin",
		"text": "Chance to Block (Tỷ lệ chặn) là cơ chế có ý nghĩa cả phòng thủ lẫn tấn công. Khi block thành công, toàn bộ sát thương từ đòn tấn công sẽ bị vô hiệu hóa, giúp tăng đáng kể khả năng sống sót. Để tận dụng cơ chế này, nhân vật phải hy sinh một phần hp tối đa. Đặc biệt quan trọng với các class chiến đấu ở tuyến đầu và chế độ Hardcore. Quái vật cũng có thể sử dụng cơ chế block.\nCơ chế hoạt động:\n   • Khi trang bị khiên, nhân vật có tỷ lệ % block nhất định (xem bằng cách di chuột vào chỉ số Defense trên màn hình nhân vật).\n   • Tỷ lệ block tối đa là 75% khi sử dụng kỹ năng không di chuyển, đứng yên, đi bộ hoặc dùng Whirlwind.\n   • Khi chạy, tỷ lệ block giảm còn 1/3 (tối đa 25%).\n   • Block thành công sẽ vô hiệu hóa toàn bộ sát thương từ đòn tấn công.\n   • Tỷ lệ block được tính dựa trên: cấp độ nhân vật (clvl), bonus riêng của từng class, tỷ lệ block cơ bản của khiên, các hiệu ứng '+x% Increase Chance to Blocking' và chỉ số Dexterity.\n   • Cơ chế block được áp dụng sau khi đòn tấn công vượt qua kiểm tra trúng đích nhưng trước các kỹ năng Dodge/Avoid/Evade của Amazon.\n   • Mỗi lần block thành công sẽ kích hoạt animation. Tốc độ animation phụ thuộc vào chỉ số '+x% Faster Block Rate'.\n   • Nhân vật có thể block liên tiếp khi animation kết thúc, dẫn đến tình trạng 'Block-Lock'.\nNhững gì có thể block được:\n - Có thể block: Melee Attacks, Tên và bolt bắn ra, Javelin, Throwing, Missle có thành phần sát thương vật lý, Death explosions của Bone Fetish và Suicide Minion, Explosions từ quái vật Fire Enchanted Elite, Smite.\n - Không thể block: Cấp 49+ Fire Arrow và Cold Arrow, Lightning Bolt, Explosion từ Molten Boulder, Sát thương vòng từ Tornado, Sát thương vòng từ Armageddon, Corpse Explosion, Charge từ Claw Viper và Reanimated Horde.\n\nChance to Block cơ bản từ Khiên: mỗi loại khiên có chance to block cơ bản riêng, bao gồm: giá trị cơ bản từ khiên và bonus theo từng class. (Ama, Sin, Barb +25%, Necro, Druid, Sorc + 20%, Pal +30%).\n\nIncrease Chance to Blocking sẽ được cộng dồn vào Chance to Block của khiên.\n\nFaster Block Rate (FBR) là chỉ số quyết định tốc độ thực hiện animation khi block của nhân vật. Khi bạn block thành công một đòn tấn công, nhân vật sẽ bị 'đơ' trong một khoảng thời gian ngắn (gọi là block animation). FBR giúp giảm thời gian này, giúp bạn thoát khỏi tình trạng block-lock (bị khóa liên tục trong animation block)."
	},
	{
		"name": "Breakpoint",
		"type": "Thông Tin",
		"text": "1. Ngưỡng (Breakpoints) là gì?\n Trong các game như Diablo II, 'breakpoints' là các mốc giá trị (thường là tốc độ thi triển phép - FCR, tốc độ tấn công - IAS, hoặc các chỉ số khác) mà khi đạt được, hiệu suất của nhân vật sẽ tăng đáng kể, ví dụ như giảm số khung hình (frame) cần thiết để hoàn thành một hành động (thi triển phép, tấn công, v.v.). Mỗi khung hình tương ứng với một khoảng thời gian rất ngắn (thường tính bằng 1/25 giây trong Diablo II). Nếu bạn tăng chỉ số mà không đạt ngưỡng, hiệu suất không cải thiện cho đến khi bạn vượt qua ngưỡng tiếp theo.\n\n2. Thay đổi về Tốc độ thi triển (Cast Rate)\n Frozen Orb giờ sử dụng khung 'chậm' của Sorceress, nghĩa là nó cần nhiều FCR hơn để đạt các ngưỡng tốc độ thi triển nhanh hơn so với trước. Điều này làm Frozen Orb khó đạt tốc độ thi triển tối ưu, có thể làm giảm hiệu quả của kỹ năng này nếu không đầu tư đủ FCR.\n Lightning chuyển sang khung 'bình thường', giúp nó dễ đạt các ngưỡng tốc độ thi triển hơn so với khung 'chậm'. Điều này có thể giúp kỹ năng Lightning trở nên mạnh hơn hoặc dễ sử dụng hơn.\n\n3. Thay đổi về Tốc độ tấn công (Attack Rate)\n Strafe: Việc loại bỏ độ trễ lần đánh tiếp theo (next-hit-delay) giúp kỹ năng này có thêm các ngưỡng cao cấp mới, nghĩa là người chơi có thể đạt tốc độ tấn công nhanh hơn ở các mức IAS cao. Điều này làm Strafe trở nên mạnh mẽ hơn, đặc biệt khi đầu tư vào IAS.\n Blade Fury: Giờ bị ảnh hưởng bởi tốc độ tấn công, sử dụng cùng ngưỡng với các bẫy khác. Điều này giúp Blade Fury trở nên linh hoạt hơn và dễ tối ưu hóa tốc độ.\n Dragon Tail: Giảm hình phạt tốc độ từ -40 xuống -20, giúp kỹ năng này nhanh hơn đáng kể, phù hợp hơn cho các build cần tốc độ tấn công.\n Fists of Fire, Claws of Thunder, Blades of Ice: Sử dụng ngưỡng chuẩn của các kỹ năng võ thuật đánh đơn, giúp đơn giản hóa việc tính toán và tối ưu hóa tốc độ tấn công.\n Whirlwind: Không còn phụ thuộc vào tốc độ tấn công, thay vào đó sử dụng số khung hình cố định (5 khung hình cho một vũ khí, 6 khung hình cho song kiếm). Điều này làm giảm lợi ích của việc đầu tư vào IAS cho Whirlwind, nhưng phiên bản Blade Dance của Assassin nhanh hơn 1 khung hình, giữ được một chút lợi thế.\n Song kiếm (Dual-wielding): Tốc độ tấn công giờ dựa trên vũ khí 'nhanh hơn' (theo IAS - WSM), thay vì tính trung bình cả hai vũ khí. Điều này có thể dẫn đến việc người chơi ưu tiên trang bị một vũ khí nhanh hơn ở tay phụ để tăng tốc độ tổng thể, nhưng cần lưu ý rằng cách tính này không chính xác hoàn toàn khi hai vũ khí có WSM khác nhau.\n Berserk: Chuyển sang sử dụng song kiếm và dùng chung ngưỡng với Frenzy, giúp Berserk trở nên mạnh mẽ hơn trong các tình huống cần tốc độ tấn công cao.\n\n4. Giới hạn số đòn của các kỹ năng đa đòn\n Các kỹ năng như Fend, Strafe, Dragon Talon, Zeal, Fury bị giới hạn số đòn mỗi lần tấn công (3 hoặc 5). Điều này làm giảm số lượng đòn trung gian, nhưng không ảnh hưởng đến ngưỡng vì các đòn trung gian vẫn sử dụng cùng ngưỡng. Tổng số khung hình mỗi lần tấn công giảm, nhưng điều này đã được cân bằng để không ảnh hưởng đến sức mạnh tổng thể của kỹ năng.\n\n5. Các thay đổi liên quan\n Burst of Speed: Tốc độ tấn công giờ phụ thuộc vào điểm cứng (hard points), nghĩa là người chơi cần đầu tư trực tiếp vào kỹ năng này để tăng tốc độ, thay vì phụ thuộc vào các yếu tố khác. Điều này có thể làm tăng tầm quan trọng của kỹ năng này trong các build Assassin.\n Amazon Spears: Cải thiện chỉ số tốc độ vũ khí thêm 10 giúp các vũ khí này nhanh hơn, làm tăng hiệu quả của các build sử dụng giáo, đặc biệt khi kết hợp với các kỹ năng như Jab hoặc Fend."
	},
	{
		"name": "botngu",
		"type": "Thông Tin",
		"text": "Chắc mày khôn?"
	},
	{
		"name" : "Item Drop Mechanics",
		"type" : "Thông Tin",
		"text" : "1. Cơ chế rơi đồ cơ bản (khi giết Mephisto).\n Khi một quái vật chết, game sẽ thực hiện một loạt các bước để quyết định phần thưởng(drop).\n• Tính số lượng vật phẩm có thể rơi (tối đa 6 vật phẩm).\n• Chọn loại vật phẩm (vũ khí, nón, tay...).\n• Chọn chất lượng vật phẩm (magic, rare...).\n• Chọn Unique hoặc set (nếu có).\n• Chọn thuộc tính cho vật phẩm (nếu có).\n Số lượng người chơi có trong 1 room chỉ ảnh hưởng trực tiếp đến bước 1: nó làm giảm xác suất không rơi đồ (gọi là NoDrop), từ đó khiến nhiều vật phẩm được rơi ra hơn. Nó không ảnh hưởng đến chất lượng vật phẩm (điều này do chỉ số Magic Find đẩm nhận).\n\n2. Khái niệm then chốt: `Treasure Class` (TC) và `NoDrop`.\n `Treasure Class`: Mỗi quái vật (monster) hoặc rương đồ (chest) sẽ thuộc một hoặc nhiều TC. Mỗi TC là một danh sách các vật phẩm có thể rơi, kèm theo xác suất cho mỗi món.\n `Picks` (lượt chọn): Mỗi TC có một số lượt chọn nhất định, quyết định số lần game sẽ quay số (roll) để được chọn vật phẩm.\n`NoDrop`: Đây là một xác suất đặc biệt trong TC, khi game quay số, nó trúng vào ô NoDrop thì lượt chọn đó sẽ không ra bất kỳ món đồ nào. Đây là yếu tố duy nhất bị ảnh hưởng bởi số lượng người chơi có trong 1 room. Càng nhiều người chơi, xác suất của NoDrop càng giảm (có thể về 0), nghĩa là bạn sẽ nhận được nhiều vật phẩm hơn.\n3. Sự khác biệt trong PD2 và bản gốc LoD.\n Ở bản Lod: Khi chơi 1 mình (player1) xác suất NoDrop rất cao (83.33% và 62.5% với 2 TC khác nhau như trong bảng). Bạn sẽ rất thường thấy quái chết mà không rơi đồ. Khi đó cần 1 room nhiều người chơi thì tỷ lệ NoDrop mới giảm đi đáng kể (21.88% và 1.64% ở player8 với 2 TC giống ở trên như trong bảng).\n Ở PD2: Ngay cả khi chơi solo, tỷ lệ NoDrop đã được giảm mạnh để tương đương với tỷ lệ của phòng có 5 người trong bản gốc. Khi có thểm người, NoDrop tiếp tục giảm và rất dễ để về 0% ngay cả trong phòng chỉ có 3-4 người. Kết quả: số lượng đồ rơi ra ở PD2 là nhiều hơn rõ rệt so với LoD, ngay cả khi chơi solo. Sự chênh lệch số đồ giữa chơi solo và chơi nhóm 8 người là không quá lớn, vì cả hai trường hợp NoDrop đều đã rất thấp."
	}
]
